################################################################################
##opyright:   HZGOSUN Tech. Co, BigData
## Filename:    springCloud stop face
## Description:  停止face服务
## Author:      yansen
## Created:     2018-05-18
################################################################################
set -x


cd `dirname $0`
BIN_DIR=`pwd`                                        ##bin 目录
cd ..
cd lib
ADDRESS_JAR_NAME=`ls ${LIB_DIR}| grep ^address-[0-9].[0-9].[0-9].jar$`                   ##获取运行jar包名
ADDRESS_JAR_PID=`jps | grep ${ADDRESS_JAR_NAME} | awk '{print $1}'`                      ##根据服务名称获取服务pid


#---------------------------------------------------------------------#
#                              定义函数                                #
#---------------------------------------------------------------------#



#####################################################################
# 函数名:stop_spring_cloud
# 描述: 停止spring cloud
# 参数: N/A
# 返回值: N/A
# 其他: N/A
#####################################################################
function stop_springCloud_address()
{
  	##杀掉进程
	kill -9 ${ADDRESS_JAR_PID}
}  



#####################################################################
# 函数名: main
# 描述: 脚本主要业务入口
# 参数: N/A
# 返回值: N/A
# 其他: N/A
#####################################################################
function main()
{
    stop_springCloud_address
}



main
